Repository: svirmasalo/woocommerce-require-registered-user
Catalog: lang/*.po
Languages: fi_fi

source: Registered user is required to access WooCommerce pages
fi_fi: Vierailijalta vaaditaan rekisteröityminen WooCommerce-sivuille päässyyn

source: Registered user is not required to access WooCommerce pages
fi_fi: Vierailijalta ei vaadita rekisteröitymistä WooCommerce-sivuille pääsyyn

source: Require Registered User
fi_fi: Vaadi rekisteröityminen

source: Require Registered User Settings
fi_fi: Vaadi rekisteröityminen -asetukset

source: The following options are used to configure Require Registered User. You might need to save data twice to make it effective.
fi_fi: Seuraavat valinnat vaikuttavat siihen Vaadi rekisteröityminen-lisäosan toimintaan. Saatat joutua tallentamaan tiedot kahdesti, jotta valinnat astuvat voimaan.

source: Prevent unregistered users to access WooCommerce pages
fi_fi: Estä rekisteröitymättömiä käyttäjiä pääsemästä WooCommerce-sivuille

source: If this is selected, users will be automatically redirected to registration form
fi_fi: Jos tämä valitaan, virailijat ohjataan automaattisesti rekisteröitymislomakkeelle

source: Enable Require Registered User
fi_fi: Aktivoi Vaadi rekisteröityminen

source: Current status is
fi_fi: Tämän hetkinen tila on

source: Only for registered users
fi_fi: Vain rekisteröityneille käyttäjille

source: WooCommerce Require Registered User
fi_fi: WooCommerce Vaadi Rekisteröityminen

source: Prevent visitors accessing WooCommerce pages
fi_fi: Estä vierailijoita pääsemstä WooCommerce-sivuille
